Revit 2027 API
ParameterTypeId.LayerElemIsCoreLayer Property
 "Is Core Layer"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LayerElemIsCoreLayer { get; }
Public Shared ReadOnly Property LayerElemIsCoreLayer As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LayerElemIsCoreLayer {
	ForgeTypeId^ get ();
}
static member LayerElemIsCoreLayer : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace